var virama = '್';
var implicita = 'ಅ';

var barematras = {
  'sk' : ['', 'ಾ', 'ಿ', 'ೀ', 'ು', 'ೂ',
          'ೃ', 'ೄ', 'ॢ', 'ॣ',
          'ೆ', 'ೇ', 'ೈ',
          'ೊ', 'ೋ', 'ೌ',
          'ಂ', 'ಃ']
};

var vowels=['ಅ', 'ಆ', 'ಇ', 'ಈ', 'ಉ', 'ಊ',
         'ಋ', 'ೠ', 'ಌ', 'ೡ',
         'ಎ', 'ಏ', 'ಐ',
         'ಒ', 'ಓ', 'ಔ',
         'ಂ', 'ಃ'];

var consonants = [
    'ಕ', 'ಖ', 'ಗ', 'ಘ', 'ಙ',
    'ಚ', 'ಛ', 'ಜ', 'ಝ', 'ಞ',
    'ಟ', 'ಠ', 'ಡ', 'ಢ', 'ಣ',
    'ತ', 'ಥ', 'ದ', 'ಧ', 'ನ',
    'ಪ', 'ಫ', 'ಬ', 'ಭ', 'ಮ',
    'ಯ', 'ರ', 'ಲ', 'ವ',
    'ಶ', 'ಷ', 'ಸ', 'ಹ', 'ಳ'];

var alphabets = {

  'sk': vowels.concat(consonants),

  'harvardkyoto':['a', 'A', 'i', 'I', 'u', 'U',
                  'R', 'RR', 'lR', 'lRR',
                  'e', 'E', 'ai',
                  'o', 'O', 'au',
                  'M', 'H',

                  'k', 'kh', 'g', 'gh', 'G',
                  'c', 'ch', 'j', 'jh', 'J',
                  'T', 'Th', 'D', 'Dh', 'N',
                  't', 'th', 'd', 'dh', 'n',
                  'p', 'ph', 'b', 'bh', 'm',
                  'y', 'r', 'l', 'v',
                  'z', 'S', 's', 'h', 'L'],

'itrans':     ['a', ['aa','A'], 'i', ['ii','I'], 'u', ['uu','U'],
              ['RRi','R^i'], ['RRI','R^I'], ['LLi','L^i'], ['LLI','L^I'],
              'e', 'E', 'ai',
              'o', 'O', 'au',
              'M', 'H',

              'k', 'kh', 'g', 'gh', ['~N','N^'],
              'ch', 'Ch', 'j', 'jh', ['~n','JN'],
              'T', 'Th', 'D', 'Dh', 'N',
              't', 'th', 'd', 'dh', 'n',
              'p', 'ph', 'b', 'bh', 'm',
              'y', 'r', 'l', ['v','w'],
              'sh', 'Sh', 's', 'h', 'L'],

'velthuis':   ['a', 'aa', 'i', 'ii', 'u', 'uu',
              '.r', '.rr', '.l', '.ll',
              'e', '.e', 'ai',
              'o', '.o', 'au',
              '.m', '.h',

              'k', 'kh', 'g', 'gh', '"n',
              'c', 'ch', 'j', 'jh', '~n',
              '.t', '.th', '.d', '.dh', '.n',
              't', 'th', 'd', 'dh', 'n',
              'p', 'ph', 'b', 'bh', 'm',
              'y', 'r', 'l', 'v',
               '"s', '.s', 's', 'h', '.l'],

'iast':          ['a', 'ā', 'i', 'ī', 'u', 'ū',
                'ṛ', 'ṝ', 'ḷ', 'ḹ',
                'e', 'ē', 'ai',
                'o', 'ō', 'au',
                'ṃ', 'ḥ',

                'k', 'kh', 'g', 'gh', 'ṅ',
                'c', 'ch', 'j', 'jh', 'ñ',
                'ṭ', 'ṭh', 'ḍ', 'ḍh', 'ṇ',
                't', 'th', 'd', 'dh', 'n',
                'p', 'ph', 'b', 'bh', 'm',
                'y', 'r', 'l', 'v',
                  'ś', 'ṣ', 's', 'h', 'ḷ'],

'IAST':          ['A', 'Ā', 'I', 'Ī', 'U', 'Ū',
                'Ṛ', 'Ṝ', 'Ḷ', 'Ḹ',
                'E', 'Ē', 'Ai',
                'O', 'Ō', 'Au',
                'Ṃ', 'Ḥ',

                'K', 'Kh', 'G', 'Gh', 'Ṅ',
                'C', 'Ch', 'J', 'Jh', 'Ñ',
                'Ṭ', 'Ṭh', 'Ḍ', 'Ḍh', 'Ṇ',
                'T', 'Th', 'D', 'Dh', 'N',
                'P', 'Ph', 'B', 'Bh', 'M',
                'Y', 'R', 'L', 'V',
                  'Ś', 'Ṣ', 'S', 'H', 'Ḷ'],

'ipa':           ['ɐ', 'ɑː', 'i', 'iː', 'u', 'uː',
                  'ɻ', 'ɻː', 'ɭ', 'ɭː',
                  'eː', 'əi', 'oː', 'əu',
                  'MMMMMMMMMMMMMMMMMMMM', 'HHHHHHHHHHHHHHHHHHHH',

                  'k', 'kʰ', 'g', 'gʱ', 'ŋ',
                  //'c͡ç', 'c͡çʰ', 'ɟ͡ʝ', 'ɟ͡ʝʱ', 'ɲ',
                  'c', 'cʰ', 'ɟ', 'ɟʱ', 'ɲ',
                  'ʈ', 'ʈʰ', 'ɖ', 'ɖʱ', 'ɳ',
                  't̪', 't̪ʰ', 'd̪', 'd̪ʱ', 'n̪',
                  'p', 'pʰ', 'b', 'bʱ', 'm',

                  'j', 'r', 'l', 'ʋ',
                  'ɕ', 'ʂ', 's̪', 'ɦ']
};
